Revit 2024 API
PipingSystem.SystemType Property
The type of this piping system.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public PipeSystemType SystemType { get; }
Visual Basic
Public ReadOnly Property SystemType As PipeSystemType
	Get
Visual C++
public:
property PipeSystemType SystemType {
	PipeSystemType get ();
}
See Also
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace